In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
import os
from sqlalchemy.types import VARCHAR, CHAR, DECIMAL, DATE, DATETIME

In [2]:
username = "root"
password = "root"

connection = f"mysql+pymysql://{username}:{urlquote(password)}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [4]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [5]:
q = '''DESCRIBE genres;'''
describe_genres = pd.read_sql(q, connection)
describe_genres

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [6]:
q = '''DESCRIBE ratings;'''
describe_ratings = pd.read_sql(q, connection)
describe_ratings

             Field         Type Null  Key Default Extra
0   average_rating  varchar(45)  YES         None
1  number_of_votes  varchar(45)  YES         None
2           tconst          int   NO  PRI    None

In [7]:
q = '''DESCRIBE title_basics;'''
describe_basics = pd.read_sql(q, connection)
describe_basics

           Field          Type Null  Key Default Extra
0         tconst           int   NO  PRI    None
1  primary_title  varchar(225)  YES         None
2     start_year           int  YES         None
3        runtime   varchar(45)  YES         None

In [8]:
basics.head(5)

NameError: name 'basics' is not defined

In [ ]:
ratings.head(5)

In [ ]:
column_name_change = {'averageRating': 'average_rating', 'numVotes': 'number_of_votes'}
ratings = ratings.rename(columns=column_name_change)

In [ ]:
ratings['tconst'].head(1)

In [ ]:
ratings.head(5)

In [ ]:
basics.head(5)

In [ ]:
genres = basics[['tconst', 'genres']].copy()
genres.head(5)

In [ ]:
basics = basics.drop(columns=['titleType', 'originalTitle','isAdult','genres'])
basics.head(5)

In [ ]:
basics = basics.rename(columns={'primaryTitle': 'primary_title', 'startYear': 'start_year', 'runtimeMinutes': 'runtime'})
basics.head(5)

In [ ]:
basics['tconst'] = basics['tconst'].str.replace('tt', '')
basics['tconst'] = basics['tconst'].astype(int)
basics.dtypes

In [ ]:
genres['tconst'] = genres['tconst'].str.replace('tt', '')
genres['tconst'] = genres['tconst'].astype(int)
genres.dtypes

In [ ]:
genres = genres.rename(columns={'tconst': 'genre_id','genres': 'genre_name'})
genres.head(9)

In [ ]:
basics.head(5)

In [ ]:
title_length = basics['primary_title'].fillna('').map(len).max()
title_length

In [ ]:
genre_length = genres['genre_name'].fillna('').map(len).max()
genre_length

In [ ]:
ratings.to_sql("ratings",connection,index=False, if_exists='append')

In [ ]:
basics.to_sql("title_basics",connection,index=False, if_exists='append')

In [ ]:
genres.to_sql("genres",connection,index=False, if_exists='append')

In [ ]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

In [ ]:
q = '''DESCRIBE genres;'''
describe_genres = pd.read_sql(q, connection)
describe_genres

In [ ]:
q = '''DESCRIBE ratings;'''
describe_ratings = pd.read_sql(q, connection)
describe_ratings

In [ ]:
q = '''DESCRIBE title_basics;'''
describe_basics = pd.read_sql(q, connection)
describe_basics

In [ ]:
q = '''SELECT *
FROM title_basics
LIMIT 5'''
title_basics_first_5_rows = pd.read_sql(q, connection)
title_basics_first_5_rows

In [ ]:
q = '''SELECT *
FROM ratings
LIMIT 5'''
ratings_first_5_rows = pd.read_sql(q, connection)
ratings_first_5_rows

In [ ]:
q = '''SELECT *
FROM genres
LIMIT 5'''
genres_first_5_rows = pd.read_sql(q, connection)
genres_first_5_rows